# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — 
# на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint


if __name__ == '__main__':
    bush_count = int(input('Введите количество кустов: '))
    lst_1 = [randint(1, 5) for _ in range(bush_count)]
    print(*lst_1)

    bush = int(input('Введите № куста: '))

    res = 0
    if bush == 1:
        res = lst_1[0] + lst_1[1] + lst_1[-1]
    elif bush == len(lst_1):
        res = lst_1[-2] + lst_1[-1] + lst_1[0]
    else:
        res = lst_1[bush - 1] + lst_1[bush - 2] + lst_1[bush]
    print(res, 'ягод')
